In [5]:
employees={
    "Name":["Alie","Bob","Charlie"],
    "Age":[23,30,25],
    "City":["Aleppo","Los Angles","Chicago"]
}

employees["Name"]

['Alie', 'Bob', 'Charlie']

In [16]:
import pandas as pd

df=pd.DataFrame(employees)

df.head(2)

   Name  Age        City
0  Alie   23      Aleppo
1   Bob   30  Los Angles

In [17]:
df["Salary"]=[5000,6000,70000]
df

      Name  Age        City  Salary
0     Alie   23      Aleppo    5000
1      Bob   30  Los Angles    6000
2  Charlie   25     Chicago   70000

In [18]:
filtered_df=df[df["Age"]>24]
filtered_df

      Name  Age        City  Salary
1      Bob   30  Los Angles    6000
2  Charlie   25     Chicago   70000